{"format": "keras", "nodes": [{"name": "input_10", "id": "input_10", "class_name": "InputLayer", "output_shape": [[null, 256, 256, 3]], "num_parameters": 0}, {"name": "efficientnetb4", "id": "efficientnetb4", "class_name": "Functional", "output_shape": [null, 8, 8, 1792], "num_parameters": 17673823}, {"name": "global_average_pooling2d_2", "id": "global_average_pooling2d_2", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 1792], "num_parameters": 0}, {"name": "dense_15", "id": "dense_15", "class_name": "Dense", "output_shape": [null, 1024], "num_parameters": 1836032}, {"name": "batch_normalization_14", "id": "batch_normalization_14", "class_name": "BatchNormalization", "output_shape": [null, 1024], "num_parameters": 4096}, {"name": "dense_16", "id": "dense_16", "class_name": "Dense", "output_shape": [null, 128], "num_parameters": 131200}, {"name": "dense_17", "id": "dense_17", "class_name": "Dense", "output_shape": [null, 4], "num_parameters": 516}], "edges": [["input_10", "efficientnetb4"], ["efficientnetb4", "global_average_pooling2d_2"], ["global_average_pooling2d_2", "dense_15"], ["dense_15", "batch_normalization_14"], ["batch_normalization_14", "dense_16"], ["dense_16", "dense_17"]]}