{"format": "keras", "nodes": [{"name": "input_3", "id": "input_3", "class_name": "InputLayer", "output_shape": [[null, 256, 256, 3]], "num_parameters": 0}, {"name": "input_4", "id": "input_4", "class_name": "InputLayer", "output_shape": [[null, 256, 256, 3]], "num_parameters": 0}, {"name": "efficientnetb4", "id": "efficientnetb4", "class_name": "Functional", "output_shape": [null, 8, 8, 1792], "num_parameters": 17673823}, {"name": "global_average_pooling2d", "id": "global_average_pooling2d", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 1792], "num_parameters": 0}, {"name": "dense_3", "id": "dense_3", "class_name": "Dense", "output_shape": [null, 1024], "num_parameters": 1836032}, {"name": "batch_normalization_4", "id": "batch_normalization_4", "class_name": "BatchNormalization", "output_shape": [null, 1024], "num_parameters": 4096}, {"name": "dense_4", "id": "dense_4", "class_name": "Dense", "output_shape": [null, 128], "num_parameters": 131200}, {"name": "dense_5", "id": "dense_5", "class_name": "Dense", "output_shape": [null, 4], "num_parameters": 516}], "edges": [["input_3", "efficientnetb4"], ["input_4", "efficientnetb4"], ["efficientnetb4", "global_average_pooling2d"], ["global_average_pooling2d", "dense_3"], ["dense_3", "batch_normalization_4"], ["batch_normalization_4", "dense_4"], ["dense_4", "dense_5"]]}